2024.09.24.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2024.09.17.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2024.10.01.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of September 17 to 24, 2024.

#+TOC: headlines 1


* ocaml-trace 0.8
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-trace-0-8/15298/1

** Simon Cruanes announced


[[https://github.com/c-cube/ocaml-trace/releases/tag/v0.8][ocaml-trace 0.8]] was just released. It features a new trace collector for multiprocess programs, and a new library, ~trace.subscriber~, for handling events in a more modular, compositional way.

For background, ~trace~ is a lightweight library that can be used to instrument your code (libraries or executable), either by hand or using ~ppx_trace~, and offers a ~collector~ abstraction to actually collect/handle/store/write the trace events somewhere. The overhead when no collector is installed is low. There are also several collectors in ~trace-tef~, ~trace-fuchsia~, and (in a separate repo) ~tracy-client~. See the [[https://github.com/c-cube/ocaml-trace/][github repo]] for more details.
      



* qcheck-lin and qcheck-stm 0.2
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-qcheck-lin-and-qcheck-stm-0-2/12301/3

** Jan Midtgaard announced


I'm happy to share the 0.4 release of ~qcheck-lin~, ~qcheck-stm~, and ~qcheck-multicoretests-util~: https://github.com/ocaml-multicore/multicoretests/releases/tag/0.4

The testing libraries are useful for testing your OCaml code for parallelism safety:
- ~qcheck-lin~ offer a low effort approach, requiring little more than type signatures of the target interface (example above)
- ~qcheck-stm~ offers stronger correctness guarantees by comparing the observed behaviour to a functional model description - under both sequential and parallel usage.

The 0.4 release brings two new "stress test" functions and also adjusts the cmd list distribution of ~STM_sequential~:

- #415: Remove ~--verbose~ in internal ~mutable_set_v5~ expect test to avoid a test failure on a slow machine
- #443: Add ~Lin_domain.stress_test~ as a lighter stress test, not requiring an interleaving search.
- #462: Add ~STM_domain.stress_test_par~, similar to ~Lin_domain.stress_test~ for STM models.
- #472: Switch ~arb_cmds~ to use an exponential distribution with a mean of 10, avoiding lists of up to 10000 cmds in ~STM_sequential~ (reported by @nikolaushuber).

Happy testing! :smiley:
      



* 3rd editor tooling dev-meeting: 26th of September 🧙
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-3rd-editor-tooling-dev-meeting-26th-of-september/15308/1

** vds announced


The meeting is back! We are organizing the next one on next Thursday, the 26th of September at 5pm CEST (sorry, still no timezone rotation, but we probably will for the next one). Whether you are a long time maintainer, an occasional contributor, a new comer, or simply a curious passer-by, please feel free to attend! 

:sparkles: For this session, @jchavarri is going to present [[https://github.com/melange-re/melange][Melange]], a toolchain that compiles ocaml/reason to javascript,  and its integration in the tooling ecosystem.

:clipboard: Meeting agenda:

- A tour-de-table to allow the participants that wish to do so to present themselves and mention issues / prs they are interested in.
- Talk and Q&A
- Discuss issues and pull requests that were tagged in advance or mentioned during the tour-de-table.

We’re looking forward to meeting you!

Meeting link: [[https://meet.google.com/nzt-owbh-yoo][https://meet.google.com/nzt-owbh-yoo ]]

Previous meeting notes are available in [[https://github.com/ocaml/merlin/wiki/Public-dev%E2%80%90meetings][Merlin’s repository wiki]].
      



* First release of hachis
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-hachis/15309/1

** François Pottier announced


It is my pleasure to announce the first release of ~hachis~, a library that offers hash sets and hash maps.

These data structures handle collisions via linear probing, a technique that relies on linear searches within an array. All of the data is stored within one large array (for hash sets) or two large arrays (for hash maps). As a result, these data structures offer good locality.

Some benchmarks suggest that ~hachis~ can consistently outperform the standard library's hash maps (~Hashtbl~).

To install the library, type ~opam update && opam install hachis~.

For more details, see the [[https://cambium.inria.fr/~fpottier/hachis/doc/hachis/][documentation]].
      

** Simon Cruanes then added


The code is [[https://github.com/fpottier/hachis][here]] for those who are
curious to see how the sausage is done :-)
      



* OCaml Platform Newsletter: June-August 2024
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ocaml-platform-newsletter-june-august-2024/15312/1

