2024.09.24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-24 Tue 15:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2024.09.17.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2024.10.01.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of September 17 to 24, 2024.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">ocaml-trace 0.8</a></li>
<li><a href="#2">qcheck-lin and qcheck-stm 0.2</a></li>
<li><a href="#3">3rd editor tooling dev-meeting: 26th of September 🧙</a></li>
<li><a href="#4">First release of hachis</a></li>
<li><a href="#5">OCaml Platform Newsletter: June-August 2024</a></li>
<li><a href="#6">First alpha release of OCaml 5.3.0</a></li>
<li><a href="#7">Ascend - Dungeon RPG for your terminal</a></li>
<li><a href="#8">first release of ppx_deriving_jsonschema</a></li>
<li><a href="#9">opam 2.3.0~alpha1</a></li>
<li><a href="#10">Other OCaml News</a></li>
<li><a href="#org08ec34d">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">ocaml-trace 0.8</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-trace-0-8/15298/1">https://discuss.ocaml.org/t/ann-ocaml-trace-0-8/15298/1</a>
</p>
</div>

<div id="outline-container-orgf2e097d" class="outline-3">
<h3 id="orgf2e097d">Simon Cruanes announced</h3>
<div class="outline-text-3" id="text-orgf2e097d">
<p>
<a href="https://github.com/c-cube/ocaml-trace/releases/tag/v0.8">ocaml-trace 0.8</a> was just released. It features a new trace collector for multiprocess programs, and a new library, <code>trace.subscriber</code>, for handling events in a more modular, compositional way.
</p>

<p>
For background, <code>trace</code> is a lightweight library that can be used to instrument your code (libraries or executable), either by hand or using <code>ppx_trace</code>, and offers a <code>collector</code> abstraction to actually collect/handle/store/write the trace events somewhere. The overhead when no collector is installed is low. There are also several collectors in <code>trace-tef</code>, <code>trace-fuchsia</code>, and (in a separate repo) <code>tracy-client</code>. See the <a href="https://github.com/c-cube/ocaml-trace/">github repo</a> for more details.
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">qcheck-lin and qcheck-stm 0.2</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-qcheck-lin-and-qcheck-stm-0-2/12301/3">https://discuss.ocaml.org/t/ann-qcheck-lin-and-qcheck-stm-0-2/12301/3</a>
</p>
</div>

<div id="outline-container-org056a3e4" class="outline-3">
<h3 id="org056a3e4">Jan Midtgaard announced</h3>
<div class="outline-text-3" id="text-org056a3e4">
<p>
I'm happy to share the 0.4 release of <code>qcheck-lin</code>, <code>qcheck-stm</code>, and <code>qcheck-multicoretests-util</code>: <a href="https://github.com/ocaml-multicore/multicoretests/releases/tag/0.4">https://github.com/ocaml-multicore/multicoretests/releases/tag/0.4</a>
</p>

<p>
The testing libraries are useful for testing your OCaml code for parallelism safety:
</p>
<ul class="org-ul">
<li><code>qcheck-lin</code> offer a low effort approach, requiring little more than type signatures of the target interface (example above)</li>
<li><code>qcheck-stm</code> offers stronger correctness guarantees by comparing the observed behaviour to a functional model description - under both sequential and parallel usage.</li>
</ul>

<p>
The 0.4 release brings two new "stress test" functions and also adjusts the cmd list distribution of <code>STM_sequential</code>:
</p>

<ul class="org-ul">
<li>#415: Remove <code>--verbose</code> in internal <code>mutable_set_v5</code> expect test to avoid a test failure on a slow machine</li>
<li>#443: Add <code>Lin_domain.stress_test</code> as a lighter stress test, not requiring an interleaving search.</li>
<li>#462: Add <code>STM_domain.stress_test_par</code>, similar to <code>Lin_domain.stress_test</code> for STM models.</li>
<li>#472: Switch <code>arb_cmds</code> to use an exponential distribution with a mean of 10, avoiding lists of up to 10000 cmds in <code>STM_sequential</code> (reported by @nikolaushuber).</li>
</ul>

<p>
Happy testing! :smiley:
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">3rd editor tooling dev-meeting: 26th of September 🧙</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-3rd-editor-tooling-dev-meeting-26th-of-september/15308/1">https://discuss.ocaml.org/t/ann-3rd-editor-tooling-dev-meeting-26th-of-september/15308/1</a>
</p>
</div>

<div id="outline-container-orgaa148aa" class="outline-3">
<h3 id="orgaa148aa">vds announced</h3>
<div class="outline-text-3" id="text-orgaa148aa">
<p>
The meeting is back! We are organizing the next one on next Thursday, the 26th of September at 5pm CEST (sorry, still no timezone rotation, but we probably will for the next one). Whether you are a long time maintainer, an occasional contributor, a new comer, or simply a curious passer-by, please feel free to attend! 
</p>

<p>
:sparkles: For this session, @jchavarri is going to present <a href="https://github.com/melange-re/melange">Melange</a>, a toolchain that compiles ocaml/reason to javascript,  and its integration in the tooling ecosystem.
</p>

<p>
:clipboard: Meeting agenda:
</p>

<ul class="org-ul">
<li>A tour-de-table to allow the participants that wish to do so to present themselves and mention issues / prs they are interested in.</li>
<li>Talk and Q&amp;A</li>
<li>Discuss issues and pull requests that were tagged in advance or mentioned during the tour-de-table.</li>
</ul>

<p>
We’re looking forward to meeting you!
</p>

<p>
Meeting link: <a href="https://meet.google.com/nzt-owbh-yoo">https://meet.google.com/nzt-owbh-yoo </a>
</p>

<p>
Previous meeting notes are available in <a href="https://github.com/ocaml/merlin/wiki/Public-dev%E2%80%90meetings">Merlin’s repository wiki</a>.
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">First release of hachis</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-hachis/15309/1">https://discuss.ocaml.org/t/ann-first-release-of-hachis/15309/1</a>
</p>
</div>

<div id="outline-container-org9ac75d9" class="outline-3">
<h3 id="org9ac75d9">François Pottier announced</h3>
<div class="outline-text-3" id="text-org9ac75d9">
<p>
It is my pleasure to announce the first release of <code>hachis</code>, a library that offers hash sets and hash maps.
</p>

<p>
These data structures handle collisions via linear probing, a technique that relies on linear searches within an array. All of the data is stored within one large array (for hash sets) or two large arrays (for hash maps). As a result, these data structures offer good locality.
</p>

<p>
Some benchmarks suggest that <code>hachis</code> can consistently outperform the standard library's hash maps (<code>Hashtbl</code>).
</p>

<p>
To install the library, type <code>opam update &amp;&amp; opam install hachis</code>.
</p>

<p>
For more details, see the <a href="https://cambium.inria.fr/~fpottier/hachis/doc/hachis/">documentation</a>.
</p>
</div>
</div>


<div id="outline-container-org76e58da" class="outline-3">
<h3 id="org76e58da">Simon Cruanes then added</h3>
<div class="outline-text-3" id="text-org76e58da">
<p>
The code is <a href="https://github.com/fpottier/hachis">here</a> for those who are
curious to see how the sausage is done :-)
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">OCaml Platform Newsletter: June-August 2024</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-platform-newsletter-june-august-2024/15312/1">https://discuss.ocaml.org/t/ocaml-platform-newsletter-june-august-2024/15312/1</a>
</p>
</div>
