2024.09.24.org
** Thibaut Mattio announced


Welcome to the twelfth edition of the OCaml Platform newsletter!

In this June-August 2024 edition, we are excited to bring you the latest on the OCaml Platform, continuing our tradition of highlighting recent developments as seen in [[https://discuss.ocaml.org/tag/platform-newsletter][previous editions]]. To understand the direction we're headed, especially regarding development workflows and user experience improvements, check out our [[https://ocaml.org/docs/platform-roadmap][roadmap]].

*Highlights:*

- *Dune package management soon in public beta:* [[https://discuss.ocaml.org/t/ann-dune-developer-preview-updates/15160][Developer Preview Program]] expands with 60+ interviews, NPS soaring from +9 to +28! Public beta coming soon with exciting features like automatic dependency locking and dev tool management. [[https://mas.to/deck/@leostera/112988841207690720][See it in action]]!
- *Opam 2.2 is out:* [[https://discuss.ocaml.org/t/ann-opam-2-2-0-is-out/14893][Native Windows support is here]]! Seamless setup with ~opam init~, ~opam-repository~ compatible with Windows. OCaml on Windows is now a reality.
- *Odoc 3.0 gets close to a release:* New features like global sidebars and media support are ready in odoc. Integration with Dune and OCaml.org pipeline in progress - get ready to test the new documentation experience soon! [[https://github.com/ocaml/odoc/discussions/1097][Check out the RFCs]].
- *Project-wide references is live:* Merlin 5.1 and OCaml LSP 1.18.0 bring powerful code navigation to your editor. Built on years of compiler work, it's a game-changer for large codebases.
- *Starting to bridge the gap between Merlin and OCaml LSP:* New LSP queries for type enclosing, documentation, and more. We’re working towards consistent, feature-rich experience across all editors powered by OCaml LSP.

*Releases:*

- [[https://ocaml.org/changelog/2024-06-10-opam-2-2-0-beta3][opam 2.2.0~beta3]]
- [[https://ocaml.org/changelog/2024-06-21-opam-2-2-0-rc1][opam 2.2.0~rc1]]
- [[https://ocaml.org/changelog/2024-07-01-opam-2-2-0][opam 2.2.0]]
- [[https://ocaml.org/changelog/2024-08-22-opam-2-2-1][opam 2.2.1]]
- [[https://ocaml.org/changelog/2024-06-17-dune.3.16.0][Dune 3.16.0]]
- opam-publish 2.3.1
- [[https://ocaml.org/changelog/2024-06-24-merlin-5.1][Merlin 5.1]]
- [[https://ocaml.org/changelog/2024-06-12-merlin-4.16][Merlin 4.16]]
- [[https://ocaml.org/changelog/2024-06-03-merlin-54.15][Merlin 4.15]]
- [[https://ocaml.org/changelog/2024-07-31-ocaml-lsp-1.19.0][OCaml LSP 1.19.0]]
- [[https://ocaml.org/changelog/2024-07-11-ocaml-lsp-1.18.0][OCaml LSP 1.18.0]]
- [[https://ocaml.org/changelog/2024-07-25-ppxlib-0.33.0][Ppxlib 0.33.0]]


