2024.09.24.html

<div id="outline-container-orgfb2fafa" class="outline-3">
<h3 id="orgfb2fafa">Thibaut Mattio announced</h3>
<div class="outline-text-3" id="text-orgfb2fafa">
<p>
Welcome to the twelfth edition of the OCaml Platform newsletter!
</p>

<p>
In this June-August 2024 edition, we are excited to bring you the latest on the OCaml Platform, continuing our tradition of highlighting recent developments as seen in <a href="https://discuss.ocaml.org/tag/platform-newsletter">previous editions</a>. To understand the direction we're headed, especially regarding development workflows and user experience improvements, check out our <a href="https://ocaml.org/docs/platform-roadmap">roadmap</a>.
</p>

<p>
<b>Highlights:</b>
</p>

<ul class="org-ul">
<li><b>Dune package management soon in public beta:</b> <a href="https://discuss.ocaml.org/t/ann-dune-developer-preview-updates/15160">Developer Preview Program</a> expands with 60+ interviews, NPS soaring from +9 to +28! Public beta coming soon with exciting features like automatic dependency locking and dev tool management. <a href="https://mas.to/deck/@leostera/112988841207690720">See it in action</a>!</li>
<li><b>Opam 2.2 is out:</b> <a href="https://discuss.ocaml.org/t/ann-opam-2-2-0-is-out/14893">Native Windows support is here</a>! Seamless setup with <code>opam init</code>, <code>opam-repository</code> compatible with Windows. OCaml on Windows is now a reality.</li>
<li><b>Odoc 3.0 gets close to a release:</b> New features like global sidebars and media support are ready in odoc. Integration with Dune and OCaml.org pipeline in progress - get ready to test the new documentation experience soon! <a href="https://github.com/ocaml/odoc/discussions/1097">Check out the RFCs</a>.</li>
<li><b>Project-wide references is live:</b> Merlin 5.1 and OCaml LSP 1.18.0 bring powerful code navigation to your editor. Built on years of compiler work, it's a game-changer for large codebases.</li>
<li><b>Starting to bridge the gap between Merlin and OCaml LSP:</b> New LSP queries for type enclosing, documentation, and more. We’re working towards consistent, feature-rich experience across all editors powered by OCaml LSP.</li>
</ul>

<p>
<b>Releases:</b>
</p>

<ul class="org-ul">
<li><a href="https://ocaml.org/changelog/2024-06-10-opam-2-2-0-beta3">opam 2.2.0~beta3</a></li>
<li><a href="https://ocaml.org/changelog/2024-06-21-opam-2-2-0-rc1">opam 2.2.0~rc1</a></li>
<li><a href="https://ocaml.org/changelog/2024-07-01-opam-2-2-0">opam 2.2.0</a></li>
<li><a href="https://ocaml.org/changelog/2024-08-22-opam-2-2-1">opam 2.2.1</a></li>
<li><a href="https://ocaml.org/changelog/2024-06-17-dune.3.16.0">Dune 3.16.0</a></li>
<li>opam-publish 2.3.1</li>
<li><a href="https://ocaml.org/changelog/2024-06-24-merlin-5.1">Merlin 5.1</a></li>
<li><a href="https://ocaml.org/changelog/2024-06-12-merlin-4.16">Merlin 4.16</a></li>
<li><a href="https://ocaml.org/changelog/2024-06-03-merlin-54.15">Merlin 4.15</a></li>
<li><a href="https://ocaml.org/changelog/2024-07-31-ocaml-lsp-1.19.0">OCaml LSP 1.19.0</a></li>
<li><a href="https://ocaml.org/changelog/2024-07-11-ocaml-lsp-1.18.0">OCaml LSP 1.18.0</a></li>
<li><a href="https://ocaml.org/changelog/2024-07-25-ppxlib-0.33.0">Ppxlib 0.33.0</a></li>
</ul>
</div>
