2024.09.24.html


<div id="outline-container-org726189c" class="outline-4">
<h4 id="org726189c"><b>Dune Package Management (<a href="https://ocaml.org/docs/platform-roadmap#w4-build-a-project">W4</a>)</b></h4>
<div class="outline-text-4" id="text-org726189c">
<p>
<b>Contributed by:</b> @rgrinberg (Tarides), @Leonidas-from-XIV (Tarides), @gridbugs (Tarides), @Alizter
</p>

<p>
<b>Synopsis:</b> Integrating package management into Dune, making it the sole tool needed for OCaml development. This unification eliminates installation time (just download Dune's pre-built binary), automates external tool management (e.g., for <code>dune fmt</code> or <code>dune ocamllsp</code>), and significantly reduces build times through caching (packages and compiler are built only once across projects).
</p>

<p>
<b>Summary:</b>
</p>

<p>
Following our announcement of reaching the Minimal Viable Product (MVP) stage for Dune's package management in the <a href="https://discuss.ocaml.org/t/ocaml-platform-newsletter-march-may-2024/14765">last newsletter</a>, we've made substantial progress on our stated goals. As promised, we've shifted our focus from prototyping to user testing and refining the developer experience (DX).
</p>

<p>
The Developer Preview Program (see <a href="https://discuss.ocaml.org/t/ann-dune-developer-preview-updates/15160">latest update</a>) has expanded significantly from its early stages. We've conducted approximately 60 developer interviews, representing a diverse cross-section of the OCaml community. The interviewees include both newcomers and experienced OCaml users. Notably, about 40% of participants have over 3 years of OCaml experience, while 35% are relative newcomers with less than a year of experience. The majority come from Linux and macOS environments, with participants representing various sectors including tech companies, research institutions, and independent developers.
</p>

<p>
These sessions have provided crucial feedback and driven improvements. This extensive user testing has paid off, with the Net Promoter Score jumping from +9 to an estimated +28 - a clear sign that the community is excited about the improvements we've made.
</p>

<p>
Key developments since the last update include:
</p>
<ul class="org-ul">
<li>A nightly binary distribution of Dune with package management enabled, which will be made available publicly in the coming weeks.</li>
<li>We started work on automated handling of developer tools (ocamlformat, ocamllsp, odoc) &#x2013; users will be able run <code>dune fmt</code>, or <code>dune ocamllsp</code>, and Dune will take care of installing OCamlFormat and OCaml LSP automatically if they are not available.</li>
<li>Implementation of automatic dependency locking when project’s dependency changes &#x2013; you can now run Dune in watch mode and let it install your dependencies without any intervention after updating your dune-project</li>
<li>We’ve enabled Dune cache by default, which works with your package dependencies. With this change, Dune will not recompile dependencies more than once when building new projects, including the compiler!</li>
</ul>

<p>
The team has moved beyond just testing with OCaml.org and Bonsai, now conducting broader compatibility tests across the opam repository. Initial results show about 50% of packages can be authored using Dune with package management, with ongoing efforts to increase the coverage (we expect resolution of a few issues on a select few foundational packages to significantly increase that percentage).
</p>

<p>
In line with the commitment to prepare for a first release, the team plans to launch a public beta in the coming weeks. This marks a significant step from our current private Developer Preview testing with selected beta testers, to a broader community release.
</p>

<p>
Stay tuned for the upcoming announcement, and in the meantime, have a look a the demos and some enthusiastic messages from beta testers:
</p>
<ul class="org-ul">
<li>Demo on <a href="https://mas.to/deck/@leostera/112988841207690720">Mastodon</a> or <a href="https://x.com/leostera/status/1825519465527673238">X</a></li>
<li>“Just did the dune package management preview, it’s looking very sharp” &#x2013; <a href="https://x.com/ckarmstrong/status/1830937156434747566">https://x.com/ckarmstrong/status/1830937156434747566</a></li>
<li>“Really looking forward to this! No more switches, no more opam, just dune behaving like a modern package manager. Having played around with it, it's just so so nice. The focus on DX really makes me hopeful about OCaml's future.” &#x2013; <a href="https://x.com/synecdokey/status/1825533523283079474">https://x.com/synecdokey/status/1825533523283079474</a></li>
</ul>

<p>
<b>Activities:</b>
</p>

<ul class="org-ul">
<li>Implemented workaround to avoid unstable compilers &#x2013; <a href="https://github.com/ocaml/dune/pull/10668">ocaml/dune#10668</a></li>
<li>Added support for multiple checksums (<a href="https://github.com/ocaml/dune/pull/10624">ocaml/dune#10624</a>, <a href="https://github.com/ocaml/dune/pull/10791">ocaml/dune#10791</a>)</li>
<li>Began upstreaming the Dune toolchain feature (<a href="https://github.com/ocaml/dune/pull/10639">ocaml/dune#10639</a>, <a href="https://github.com/ocaml/dune/pull/10719">ocaml/dune#10719</a>)</li>
<li>Added implicit relock when dependencies change &#x2013; <a href="https://github.com/ocaml/dune/pull/10641">ocaml/dune#10641</a></li>
<li>Improved dependency solving and constraint handling (<a href="https://github.com/ocaml/dune/pull/10726">ocaml/dune#10726</a>)</li>
<li>Added developer preview features and configuration options (<a href="https://github.com/ocaml/dune/pull/10627">ocaml/dune#10627</a>)</li>
<li>Implemented progress indicators for package builds and lockfile generation (<a href="https://github.com/ocaml/dune/pull/10802">ocaml/dune#10802</a>, <a href="https://github.com/ocaml/dune/pull/10803">ocaml/dune#10803</a>)</li>
<li>Improved error messages and logging (<a href="https://github.com/ocaml/dune/pull/10662">ocaml/dune#10662</a>)</li>
<li>Created extensive test suite for new package management features (<a href="https://github.com/ocaml/dune/pull/10798">ocaml/dune#10798</a>)</li>
<li>Resolved issues with building specific packages (e.g., seq, lwt) (<a href="https://github.com/ocaml/dune/issues/10788">ocaml/dune#10788</a>, <a href="https://github.com/ocaml/dune/issues/10839">ocaml/dune#10839</a>)</li>
<li>Enable cache on fetch actions for faster builds (<a href="https://github.com/ocaml/dune/pull/10850">ocaml/dune#10850</a>)</li>
<li>Improved handling of dev tools like ocamlformat (<a href="https://github.com/ocaml/dune/pull/10647">ocaml/dune#10647</a>)</li>
<li>Developed tools for testing package compatibility coverage on opam-repository</li>
</ul>
</div>
</div>
