2024.09.24.org
*** *Native Support for Windows in opam 2.2 ([[https://ocaml.org/docs/platform-roadmap#w5-manage-dependencies][W5]])*

*Contributed by:* @rjbou (OCamlPro), @kit-ty-kate (Ahrefs), @dra27 (Tarides), @AltGr (OCamlPro)

*Synopsis:* Releasing opam 2.2 with native Windows support to enhance OCaml's viability on Windows, making the official ~opam-repository~ usable on Windows and encouraging more Windows-friendly packages.

*Summary:*

The release of opam 2.2.0, [[https://discuss.ocaml.org/t/ann-opam-2-2-0-is-out/14893][announced on Discuss]] early July, marks a significant milestone for the OCaml ecosystem. This version brings native support for both the opam client and compiler packages in ~opam-repository~ on Windows, opening new possibilities for OCaml development on this platform.

opam 2.2.0 officially supports Cygwin and is compatible with MSYS2. Windows users can now run ~opam init~ in their preferred console for a guided setup, resulting in a fully functional OCaml environment. This release represents the culmination of a [[https://github.com/ocaml/opam/issues/246#issuecomment-2166133625][multi-year effort]] involving extensive contributions from the community.

The OCaml ecosystem is already adapting to this new capability. A [[https://github.com/ocaml/opam-repository/pull/26069][CI check for Windows compilation]] has been added to opam-repository, and the [[https://github.com/ocaml/setup-ocaml/releases/tag/v3.0.0][GitHub Action ocaml/setup-ocaml]] now uses opam 2.2.0, facilitating OCaml development on Windows in GitHub projects.

Community members are actively working to improve Windows compatibility across the ecosystem. Notable efforts include [[https://github.com/hhugo][Hugo Heuzard's]] work on [[https://github.com/ocaml/opam-repository/pull/26164][OCamlBuild]] and several other [[https://github.com/ocaml/opam-repository/pulls?q=is%3Apr+windows+created%3A%3E2023-06-01][Windows-related PRs]].

We encourage package authors to set up Windows CI for their projects and address Windows-related issues. This collective effort will be crucial in expanding OCaml's reach and usability on the Windows platform.

*Activities:*

- Opam binary:
    * Fixed issues with ~opam init~ on Windows -- [[https://github.com/ocaml/opam/pull/5991][ocaml/opam#5991]], [[https://github.com/ocaml/opam/pull/5992][ocaml/opam#5992]], [[https://github.com/ocaml/opam/pull/5993][ocaml/opam#5993]], [[https://github.com/ocaml/opam/pull/5994][ocaml/opam#5994]], [[https://github.com/ocaml/opam/pull/5995][ocaml/opam#5995]], [[https://github.com/ocaml/opam/pull/5996][ocaml/opam#5996]], [[https://github.com/ocaml/opam/pull/5997][ocaml/opam#5997]], [[https://github.com/ocaml/opam/pull/5998][ocaml/opam#5998]], [[https://github.com/ocaml/opam/pull/6000][ocaml/opam#6000]]
    * Improved status display during slow operations on Windows -- [[https://github.com/ocaml/opam/pull/5977][ocaml/opam#5977]]
    * Enabled opam to work with Windows usernames containing spaces -- [[https://github.com/ocaml/opam/pull/5457][ocaml/opam#5457]]
    * Fixed ~opam init -yn~ to handle menus in the release candidate -- [[https://github.com/ocaml/opam/pull/6033][ocaml/opam#6033]]
    * Updated PowerShell script for installing opam from GitHub releases: [[https://github.com/ocaml/opam/pull/5906][ocaml/opam#5906]]
    * Fixed hang issue with ~setup-ocaml~ and depexts -- [[https://github.com/ocaml/opam/pull/6046][ocaml/opam#6046]]
- Update opam-repository to be compatible with Windows:
    * Updated ~opam-repository~ Windows CI -- [[https://github.com/ocaml/opam-repository/pull/26081][ocaml/opam-repository#26081]], [[https://github.com/ocaml/opam-repository/pull/26073][ocaml/opam-repository#26073]], [[https://github.com/ocaml/opam-repository/pull/26080][ocaml/opam-repository#26080]]
    * Added backport of MSVC in OCaml-variants.5.2.0+msvc -- [[https://github.com/ocaml/opam-repository/pull/26082][ocaml/opam-repository#26082]]
    * Updated native Cygwin depexts -- [[https://github.com/ocaml/opam-repository/pull/26130][ocaml/opam-repository#26130]]
    * Updated opam-repository with Windows-specific package information:
        * Added Windows compiler packages ([[https://github.com/ocaml/opam-repository/pull/25861][ocaml/opam-repository#25861]])
        * Fixed issues with OCaml variants on Windows ([[https://github.com/ocaml/opam-repository/pull/26033][ocaml/opam-repository#26033]])
    * Updated and released mingw-w64-shims.0.2.0 to fix setup-ocaml issues ([[https://github.com/ocaml/opam-repository/pull/26123][ocaml/opam-repository#26123]])
- Released stable version of opam 2.2.0 with full Windows support 🎉 ([[https://ocaml.org/changelog/2024-01-18-opam-2-2-0-beta1][announcement]])

