2024.09.24.html


<div id="outline-container-org868fc3e" class="outline-4">
<h4 id="org868fc3e"><b>Native Support for Windows in opam 2.2 (<a href="https://ocaml.org/docs/platform-roadmap#w5-manage-dependencies">W5</a>)</b></h4>
<div class="outline-text-4" id="text-org868fc3e">
<p>
<b>Contributed by:</b> @rjbou (OCamlPro), @kit-ty-kate (Ahrefs), @dra27 (Tarides), @AltGr (OCamlPro)
</p>

<p>
<b>Synopsis:</b> Releasing opam 2.2 with native Windows support to enhance OCaml's viability on Windows, making the official <code>opam-repository</code> usable on Windows and encouraging more Windows-friendly packages.
</p>

<p>
<b>Summary:</b>
</p>

<p>
The release of opam 2.2.0, <a href="https://discuss.ocaml.org/t/ann-opam-2-2-0-is-out/14893">announced on Discuss</a> early July, marks a significant milestone for the OCaml ecosystem. This version brings native support for both the opam client and compiler packages in <code>opam-repository</code> on Windows, opening new possibilities for OCaml development on this platform.
</p>

<p>
opam 2.2.0 officially supports Cygwin and is compatible with MSYS2. Windows users can now run <code>opam init</code> in their preferred console for a guided setup, resulting in a fully functional OCaml environment. This release represents the culmination of a <a href="https://github.com/ocaml/opam/issues/246#issuecomment-2166133625">multi-year effort</a> involving extensive contributions from the community.
</p>

<p>
The OCaml ecosystem is already adapting to this new capability. A <a href="https://github.com/ocaml/opam-repository/pull/26069">CI check for Windows compilation</a> has been added to opam-repository, and the <a href="https://github.com/ocaml/setup-ocaml/releases/tag/v3.0.0">GitHub Action ocaml/setup-ocaml</a> now uses opam 2.2.0, facilitating OCaml development on Windows in GitHub projects.
</p>

<p>
Community members are actively working to improve Windows compatibility across the ecosystem. Notable efforts include <a href="https://github.com/hhugo">Hugo Heuzard's</a> work on <a href="https://github.com/ocaml/opam-repository/pull/26164">OCamlBuild</a> and several other <a href="https://github.com/ocaml/opam-repository/pulls?q=is%3Apr+windows+created%3A%3E2023-06-01">Windows-related PRs</a>.
</p>

<p>
We encourage package authors to set up Windows CI for their projects and address Windows-related issues. This collective effort will be crucial in expanding OCaml's reach and usability on the Windows platform.
</p>

<p>
<b>Activities:</b>
</p>

<ul class="org-ul">
<li>Opam binary:
<ul class="org-ul">
<li>Fixed issues with <code>opam init</code> on Windows &#x2013; <a href="https://github.com/ocaml/opam/pull/5991">ocaml/opam#5991</a>, <a href="https://github.com/ocaml/opam/pull/5992">ocaml/opam#5992</a>, <a href="https://github.com/ocaml/opam/pull/5993">ocaml/opam#5993</a>, <a href="https://github.com/ocaml/opam/pull/5994">ocaml/opam#5994</a>, <a href="https://github.com/ocaml/opam/pull/5995">ocaml/opam#5995</a>, <a href="https://github.com/ocaml/opam/pull/5996">ocaml/opam#5996</a>, <a href="https://github.com/ocaml/opam/pull/5997">ocaml/opam#5997</a>, <a href="https://github.com/ocaml/opam/pull/5998">ocaml/opam#5998</a>, <a href="https://github.com/ocaml/opam/pull/6000">ocaml/opam#6000</a></li>
<li>Improved status display during slow operations on Windows &#x2013; <a href="https://github.com/ocaml/opam/pull/5977">ocaml/opam#5977</a></li>
<li>Enabled opam to work with Windows usernames containing spaces &#x2013; <a href="https://github.com/ocaml/opam/pull/5457">ocaml/opam#5457</a></li>
<li>Fixed <code>opam init -yn</code> to handle menus in the release candidate &#x2013; <a href="https://github.com/ocaml/opam/pull/6033">ocaml/opam#6033</a></li>
<li>Updated PowerShell script for installing opam from GitHub releases: <a href="https://github.com/ocaml/opam/pull/5906">ocaml/opam#5906</a></li>
<li>Fixed hang issue with <code>setup-ocaml</code> and depexts &#x2013; <a href="https://github.com/ocaml/opam/pull/6046">ocaml/opam#6046</a></li>
</ul></li>
<li>Update opam-repository to be compatible with Windows:
<ul class="org-ul">
<li>Updated <code>opam-repository</code> Windows CI &#x2013; <a href="https://github.com/ocaml/opam-repository/pull/26081">ocaml/opam-repository#26081</a>, <a href="https://github.com/ocaml/opam-repository/pull/26073">ocaml/opam-repository#26073</a>, <a href="https://github.com/ocaml/opam-repository/pull/26080">ocaml/opam-repository#26080</a></li>
<li>Added backport of MSVC in OCaml-variants.5.2.0+msvc &#x2013; <a href="https://github.com/ocaml/opam-repository/pull/26082">ocaml/opam-repository#26082</a></li>
<li>Updated native Cygwin depexts &#x2013; <a href="https://github.com/ocaml/opam-repository/pull/26130">ocaml/opam-repository#26130</a></li>
<li>Updated opam-repository with Windows-specific package information:
<ul class="org-ul">
<li>Added Windows compiler packages (<a href="https://github.com/ocaml/opam-repository/pull/25861">ocaml/opam-repository#25861</a>)</li>
<li>Fixed issues with OCaml variants on Windows (<a href="https://github.com/ocaml/opam-repository/pull/26033">ocaml/opam-repository#26033</a>)</li>
</ul></li>
<li>Updated and released mingw-w64-shims.0.2.0 to fix setup-ocaml issues (<a href="https://github.com/ocaml/opam-repository/pull/26123">ocaml/opam-repository#26123</a>)</li>
</ul></li>
<li>Released stable version of opam 2.2.0 with full Windows support 🎉 (<a href="https://ocaml.org/changelog/2024-01-18-opam-2-2-0-beta1">announcement</a>)</li>
</ul>
</div>
</div>
