2024.09.24.org
*** *Upgrading OCaml Package Documentation with Odoc 3.0 ([[https://ocaml.org/docs/platform-roadmap#w25-generate-documentation][W25]])*

*Contributed by:* @jonludlam (Tarides), @julow (Tarides), @panglesd (Tarides), @EmileTrotignon (Tarides), Luke Maurer (Jane Street)

*Synopsis:* Upgrading OCaml package documentation experience with odoc 3, featuring improved navigation, cross-package referencing, media support, and more. This upgrade aims to improve the documentation experience both locally and on OCaml.org, encouraging higher-quality package documentation.

*Summary:*

Following the completion and community review of the RFCs for odoc 3.0, we've made significant strides in implementing the new design and features. Our progress over the past few months has brought us close to a complete implementation of the odoc 3.0 feature set. As we finalize development and approach the first release, our focus is shifting towards integration with the rest of the ecosystem.

Key Developments in the past months include:

- Adding new options to the ~odoc~ CLI to begin the implementation of the ~odoc~ 3 CLI
- Implementing new syntax such as path-references
- Developing the global sidebar with a TOC featuring standalone pages and package module hierarchy

As we near completion of the core odoc 3.0 feature set, our focus is shifting towards finalizing integration with Dune and the OCaml.org documentation pipeline. We're excited to get all of these improvements in your hands and get your feedback on the new documentation experience. Stay tuned for announcements regarding testing opportunities and the upcoming release of odoc 3.0!

*Activities:*

- Added ~path-references~ lookup functionality -- [[https://github.com/ocaml/odoc/pull/1150][ocaml/odoc#1150]]
- Added the ~--current-package~ option -- [[https://github.com/ocaml/odoc/pull/1151][ocaml/odoc#1151]]
- Fixed hierarchical pages being given wrong parent ID -- [[https://github.com/ocaml/odoc/pull/1148][ocaml/odoc#1148]]
- Parsing of ~path-references~ to pages and modules ([[https://github.com/ocaml/odoc/pull/1142][ocaml/odoc#1142]])
- Support for assets and media in documentation ([[https://github.com/ocaml/odoc/pull/1184][ocaml/odoc#1184]])
- Implemented "Global" sidebar feature ([[https://github.com/ocaml/odoc/pull/1145][ocaml/odoc#1145]])
- Added support for external pages and non-package documentation ([[https://github.com/ocaml/odoc/pull/1183][ocaml/odoc#1183]])
- Improved CSS for better visual presentation ([[https://github.com/ocaml/odoc/pull/1159][ocaml/odoc#1159]])
- Add a marshalled output for index generation ([[https://github.com/ocaml/odoc/pull/1084][ocaml/odoc#1084]])
- Implemented Voodoo/Dune driver for improved integration ([[https://github.com/ocaml/odoc/pull/1168][ocaml/odoc#1168]])
- Added frontmatter support to mld pages ([[https://github.com/ocaml/odoc/pull/1187][ocaml/odoc#1187]])
- Improved breadcrumbs to show packages and libraries ([[https://github.com/ocaml/odoc/pull/1190][ocaml/odoc#1190]])

*** *Project-Wide References in OCaml Editors ([[https://ocaml.org/docs/platform-roadmap#w19-navigate-code][W19]])*

*Contributed by:* @vds (Tarides)

*Synopsis:* Introducing project-wide reference features in Merlin and OCaml LSP to enhance code navigation and refactoring capabilities, bringing OCaml's editor experience in line with other modern programming languages.

*Summary:*

As [[https://discuss.ocaml.org/t/ann-project-wide-occurrences-in-merlin-and-lsp/14847][announced]] in June, Merlin project-wide references is now available in Merlin 5.1 and the preview of OCaml LSP 1.18.0. Users of LSP-powered editors (like VSCode with the OCaml Platform extension) and classic Emacs and Vim plugins can now query project-wide references of OCaml terms. This requires building the index with the new Dune alias ~@ocaml-index~.

This release represents the culmination of a multiyear effort by the Merlin team, including extensive work on the compiler to provide the necessary information for implementing this feature in Merlin.

We're thrilled to share this feature with the community and look forward to your feedback.

While the feature should work well in most cases, we're aware of some limitations. Our next steps include adding support for interface files and module paths. Stay tuned!

*Activities:*

- Completed work on incremental occurrences indexation and related Dune rules -- [[https://github.com/ocaml/dune/pull/10422][ocaml/dune#10422]]
- Fixed issues with querying from interface files -- [[https://github.com/ocaml/merlin/pull/1779][ocaml/merlin#1779]], [[https://github.com/ocaml/merlin/pull/1781][ocaml/merlin#1781]]
- Improved behavior when cursor is on label/constructor declarations -- [[https://github.com/ocaml/merlin/pull/1785][ocaml/merlin#1785]]
- Released ~Merlin.5.1-502~, ~ocaml-index.1.0~, and a new preview of ~ocaml-lsp-server~ with project-wide occurrences support -- [[https://github.com/ocaml/opam-repository/pull/26114][ocaml/opam-repository#26114]]
- Announced the release on Discuss -- [[https://discuss.ocaml.org/t/ann-project-wide-occurrences-in-merlin-and-lsp/14847][Project-wide occurrences in Merlin and LSP]]
- Wrote a [[https://github.com/ocaml/merlin/wiki/Get-project%E2%80%90wide-occurrences][wiki page]] for project-wide occurrences
- Updated [[https://ocaml.github.io/merlin/editor/emacs/#search-for-an-identifiers-occurrences][the Merlin website]]
- Updated the [[https://github.com/ocaml/ocaml.org/pull/2580][platform changelog]]
- Improved handling of label and constructor declarations ([[https://github.com/ocaml/merlin/pull/1785][ocaml/merlin#1785]])
- Contributed compiler improvements:
- Implemented distinct unique identifiers for implementations and interfaces ([[https://github.com/ocaml/ocaml/pull/13286][ocaml/ocaml#13286]])
- Developed a system for linking unique identifiers of declarations ([[https://github.com/ocaml/ocaml/pull/13308][ocaml/ocaml#13308]])
- Contributed to improvements in longident locations ([[https://github.com/ocaml/ocaml/pull/13302][ocaml/ocaml#13302]])

