2024.09.24.html

<div id="outline-container-orgf9fe022" class="outline-4">
<h4 id="orgf9fe022"><b>Upgrading OCaml Package Documentation with Odoc 3.0 (<a href="https://ocaml.org/docs/platform-roadmap#w25-generate-documentation">W25</a>)</b></h4>
<div class="outline-text-4" id="text-orgf9fe022">
<p>
<b>Contributed by:</b> @jonludlam (Tarides), @julow (Tarides), @panglesd (Tarides), @EmileTrotignon (Tarides), Luke Maurer (Jane Street)
</p>

<p>
<b>Synopsis:</b> Upgrading OCaml package documentation experience with odoc 3, featuring improved navigation, cross-package referencing, media support, and more. This upgrade aims to improve the documentation experience both locally and on OCaml.org, encouraging higher-quality package documentation.
</p>

<p>
<b>Summary:</b>
</p>

<p>
Following the completion and community review of the RFCs for odoc 3.0, we've made significant strides in implementing the new design and features. Our progress over the past few months has brought us close to a complete implementation of the odoc 3.0 feature set. As we finalize development and approach the first release, our focus is shifting towards integration with the rest of the ecosystem.
</p>

<p>
Key Developments in the past months include:
</p>

<ul class="org-ul">
<li>Adding new options to the <code>odoc</code> CLI to begin the implementation of the <code>odoc</code> 3 CLI</li>
<li>Implementing new syntax such as path-references</li>
<li>Developing the global sidebar with a TOC featuring standalone pages and package module hierarchy</li>
</ul>

<p>
As we near completion of the core odoc 3.0 feature set, our focus is shifting towards finalizing integration with Dune and the OCaml.org documentation pipeline. We're excited to get all of these improvements in your hands and get your feedback on the new documentation experience. Stay tuned for announcements regarding testing opportunities and the upcoming release of odoc 3.0!
</p>

<p>
<b>Activities:</b>
</p>

<ul class="org-ul">
<li>Added <code>path-references</code> lookup functionality &#x2013; <a href="https://github.com/ocaml/odoc/pull/1150">ocaml/odoc#1150</a></li>
<li>Added the <code>--current-package</code> option &#x2013; <a href="https://github.com/ocaml/odoc/pull/1151">ocaml/odoc#1151</a></li>
<li>Fixed hierarchical pages being given wrong parent ID &#x2013; <a href="https://github.com/ocaml/odoc/pull/1148">ocaml/odoc#1148</a></li>
<li>Parsing of <code>path-references</code> to pages and modules (<a href="https://github.com/ocaml/odoc/pull/1142">ocaml/odoc#1142</a>)</li>
<li>Support for assets and media in documentation (<a href="https://github.com/ocaml/odoc/pull/1184">ocaml/odoc#1184</a>)</li>
<li>Implemented "Global" sidebar feature (<a href="https://github.com/ocaml/odoc/pull/1145">ocaml/odoc#1145</a>)</li>
<li>Added support for external pages and non-package documentation (<a href="https://github.com/ocaml/odoc/pull/1183">ocaml/odoc#1183</a>)</li>
<li>Improved CSS for better visual presentation (<a href="https://github.com/ocaml/odoc/pull/1159">ocaml/odoc#1159</a>)</li>
<li>Add a marshalled output for index generation (<a href="https://github.com/ocaml/odoc/pull/1084">ocaml/odoc#1084</a>)</li>
<li>Implemented Voodoo/Dune driver for improved integration (<a href="https://github.com/ocaml/odoc/pull/1168">ocaml/odoc#1168</a>)</li>
<li>Added frontmatter support to mld pages (<a href="https://github.com/ocaml/odoc/pull/1187">ocaml/odoc#1187</a>)</li>
<li>Improved breadcrumbs to show packages and libraries (<a href="https://github.com/ocaml/odoc/pull/1190">ocaml/odoc#1190</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org822485b" class="outline-4">
<h4 id="org822485b"><b>Project-Wide References in OCaml Editors (<a href="https://ocaml.org/docs/platform-roadmap#w19-navigate-code">W19</a>)</b></h4>
<div class="outline-text-4" id="text-org822485b">
<p>
<b>Contributed by:</b> @vds (Tarides)
</p>

<p>
<b>Synopsis:</b> Introducing project-wide reference features in Merlin and OCaml LSP to enhance code navigation and refactoring capabilities, bringing OCaml's editor experience in line with other modern programming languages.
</p>

<p>
<b>Summary:</b>
</p>

<p>
As <a href="https://discuss.ocaml.org/t/ann-project-wide-occurrences-in-merlin-and-lsp/14847">announced</a> in June, Merlin project-wide references is now available in Merlin 5.1 and the preview of OCaml LSP 1.18.0. Users of LSP-powered editors (like VSCode with the OCaml Platform extension) and classic Emacs and Vim plugins can now query project-wide references of OCaml terms. This requires building the index with the new Dune alias <code>@ocaml-index</code>.
</p>

<p>
This release represents the culmination of a multiyear effort by the Merlin team, including extensive work on the compiler to provide the necessary information for implementing this feature in Merlin.
</p>

<p>
We're thrilled to share this feature with the community and look forward to your feedback.
</p>

<p>
While the feature should work well in most cases, we're aware of some limitations. Our next steps include adding support for interface files and module paths. Stay tuned!
</p>

<p>
<b>Activities:</b>
</p>

<ul class="org-ul">
<li>Completed work on incremental occurrences indexation and related Dune rules &#x2013; <a href="https://github.com/ocaml/dune/pull/10422">ocaml/dune#10422</a></li>
<li>Fixed issues with querying from interface files &#x2013; <a href="https://github.com/ocaml/merlin/pull/1779">ocaml/merlin#1779</a>, <a href="https://github.com/ocaml/merlin/pull/1781">ocaml/merlin#1781</a></li>
<li>Improved behavior when cursor is on label/constructor declarations &#x2013; <a href="https://github.com/ocaml/merlin/pull/1785">ocaml/merlin#1785</a></li>
<li>Released <code>Merlin.5.1-502</code>, <code>ocaml-index.1.0</code>, and a new preview of <code>ocaml-lsp-server</code> with project-wide occurrences support &#x2013; <a href="https://github.com/ocaml/opam-repository/pull/26114">ocaml/opam-repository#26114</a></li>
<li>Announced the release on Discuss &#x2013; <a href="https://discuss.ocaml.org/t/ann-project-wide-occurrences-in-merlin-and-lsp/14847">Project-wide occurrences in Merlin and LSP</a></li>
<li>Wrote a <a href="https://github.com/ocaml/merlin/wiki/Get-project%E2%80%90wide-occurrences">wiki page</a> for project-wide occurrences</li>
<li>Updated <a href="https://ocaml.github.io/merlin/editor/emacs/#search-for-an-identifiers-occurrences">the Merlin website</a></li>
<li>Updated the <a href="https://github.com/ocaml/ocaml.org/pull/2580">platform changelog</a></li>
<li>Improved handling of label and constructor declarations (<a href="https://github.com/ocaml/merlin/pull/1785">ocaml/merlin#1785</a>)</li>
<li>Contributed compiler improvements:</li>
<li>Implemented distinct unique identifiers for implementations and interfaces (<a href="https://github.com/ocaml/ocaml/pull/13286">ocaml/ocaml#13286</a>)</li>
<li>Developed a system for linking unique identifiers of declarations (<a href="https://github.com/ocaml/ocaml/pull/13308">ocaml/ocaml#13308</a>)</li>
<li>Contributed to improvements in longident locations (<a href="https://github.com/ocaml/ocaml/pull/13302">ocaml/ocaml#13302</a>)</li>
</ul>
</div>
</div>
