2024.09.24.org
*** *Bridging the Gap Between Merlin and OCaml LSP ([[https://ocaml.org/docs/platform-roadmap#w19-navigate-code][W19]])*

*Contributed by:* @xvw (Tarides), @vds (Tarides)

*Synopsis:* Working towards feature parity between Merlin and OCaml LSP to provide a consistent, feature-rich development experience across all editors, making OCaml LSP the comprehensive backend for OCaml editor support.

*Summary:*

In June, we started work on bridging the gap between OCaml LSP and Merlin. We've started with exposing Merlin's type-enclosing request in OCaml LSP. The feature is now available as ~ocamllsp/typeEnclosing~ and we will work on editor integration next.

As a reminder, Merlin's ~type-enclosing~ feature allows users to get the type of the identifier under the cursor. It highlights the identifier and displays its type. Users can climb the typed-tree to display the type of larger expressions surrounding the cursor.

Since June, we’ve worked on a number of new LSP queries and code actions, including:
- A custom ~ocamllsp/getDocumentation~ query to request the ~odoc~ documentation
- A custom ~ocamllsp/construct~ query to browse and fill typed holes (~_~)
- A code-action for syntactic and semantic movement shortcuts based on Merlin's Jump command

*Activities*

- Added custom queries for type enclosing and documentation retrieval:
    * Type enclosing query ([[https://github.com/ocaml/ocaml-lsp/pull/1304][ocaml/ocaml-lsp#1304]])
    * Documentation query ([[https://github.com/ocaml/ocaml-lsp/pull/1336][ocaml/ocaml-lsp#1336]])
- Created a custom construct query ([[https://github.com/ocaml/ocaml-lsp/pull/1348][ocaml/ocaml-lsp#1348]])
- Implemented semantic and syntactic movement shortcuts ([[https://github.com/ocaml/ocaml-lsp/pull/1364][ocaml/ocaml-lsp#1364]])
- Backported and released Merlin 4.16 with necessary commands ([[https://github.com/ocaml/opam-repository/pull/26052][opam-repository PR]])
- Refactored usage of ~Typedtree~ from ~ocaml-lsp~ to ~merlin-lib~ ([[https://github.com/ocaml/merlin/pull/1811][ocaml/merlin#1811]], [[https://github.com/ocaml/merlin/pull/1812][ocaml/merlin#1812]])
      



* First alpha release of OCaml 5.3.0
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/first-alpha-release-of-ocaml-5-3-0/15315/1

** octachron announced


Four months after the release of OCaml 5.2.0, the set of new features for the future version 5.3.0 of OCaml has been frozen. We are thus happy to announce the first alpha release for OCaml 5.3.0.

This alpha version is here to help fellow hackers join us early in our bug hunting and opam ecosystem fixing fun (see below for the installation instructions). More information about the whole release process is now available in the [[https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md][compiler repository]].

The progresses on stabilizing the ecosystem are tracked on the [[https://github.com/ocaml/opam-repository/issues/26596][opam readiness for 5.3.0 meta-issue]].

The full release is expected around November, see the [[https://github.com/ocaml/ocaml/blob/trunk/release-info/calendar.md][new prospective calendar]] for more information.

If you find any bugs, please report them on [[https://github.com/ocaml/ocaml/issues][OCaml's issue tracker]].

If you are interested in the ongoing list of new features and bug fixes, the updated change log for OCaml 5.3.0 is available [[https://github.com/ocaml/ocaml/blob/5.3/Changes][on GitHub]].


*** Installation Instructions

The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:

#+begin_example
opam update
opam switch create 5.3.0~alpha1
#+end_example

The source code for the alpha is also available at these addresses:

- [[https://github.com/ocaml/ocaml/archive/5.3.0-alpha1.tar.gz][GitHub]]
- [[https://caml.inria.fr/pub/distrib/ocaml-5.3/ocaml-5.3.0~alpha1.tar.gz][OCaml archives at Inria]]

**** Fine-Tuned Compiler Configuration

If you want to tweak the configuration of the compiler, you can switch to the option variant with:

#+begin_example
opam update
opam switch create <switch_name> ocaml-variants.5.3.0~alpha1+options <option_list>
#+end_example

where ~option_list~ is a space separated list of ~ocaml-option-*~ packages. For instance, for a flambda and no-flat-float-array switch:

#+begin_example
opam switch create 5.3.0~alpha1+flambda+nffa ocaml-variants.5.3.0~alpha1+options ocaml-option-flambda ocaml-option-no-flat-float-array
#+end_example

All available options can be listed with ~opam search ocaml-option~.
      



* Ascend - Dungeon RPG for your terminal
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-ascend-dungeon-rpg-for-your-terminal/15319/1

** eir announced


Announcing the first release of *[[https://github.com/m-laniakea/ascend][ascend]]*!

Venture into the depths to retrieve the stolen artifact, and hopefully escape with your life...
NetHack lite.

*Get it via:*
#+begin_example
opam install ascend
ascend
#+end_example

Rievax the Revelator is recruiting you for some "manual testing".
      



* first release of ppx_deriving_jsonschema
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-ppx-deriving-jsonschema/15320/1

