2024.09.24.html

<div id="outline-container-org5e5cf49" class="outline-4">
<h4 id="org5e5cf49"><b>Bridging the Gap Between Merlin and OCaml LSP (<a href="https://ocaml.org/docs/platform-roadmap#w19-navigate-code">W19</a>)</b></h4>
<div class="outline-text-4" id="text-org5e5cf49">
<p>
<b>Contributed by:</b> @xvw (Tarides), @vds (Tarides)
</p>

<p>
<b>Synopsis:</b> Working towards feature parity between Merlin and OCaml LSP to provide a consistent, feature-rich development experience across all editors, making OCaml LSP the comprehensive backend for OCaml editor support.
</p>

<p>
<b>Summary:</b>
</p>

<p>
In June, we started work on bridging the gap between OCaml LSP and Merlin. We've started with exposing Merlin's type-enclosing request in OCaml LSP. The feature is now available as <code>ocamllsp/typeEnclosing</code> and we will work on editor integration next.
</p>

<p>
As a reminder, Merlin's <code>type-enclosing</code> feature allows users to get the type of the identifier under the cursor. It highlights the identifier and displays its type. Users can climb the typed-tree to display the type of larger expressions surrounding the cursor.
</p>

<p>
Since June, we’ve worked on a number of new LSP queries and code actions, including:
</p>
<ul class="org-ul">
<li>A custom <code>ocamllsp/getDocumentation</code> query to request the <code>odoc</code> documentation</li>
<li>A custom <code>ocamllsp/construct</code> query to browse and fill typed holes (<code>_</code>)</li>
<li>A code-action for syntactic and semantic movement shortcuts based on Merlin's Jump command</li>
</ul>

<p>
<b>Activities</b>
</p>

<ul class="org-ul">
<li>Added custom queries for type enclosing and documentation retrieval:
<ul class="org-ul">
<li>Type enclosing query (<a href="https://github.com/ocaml/ocaml-lsp/pull/1304">ocaml/ocaml-lsp#1304</a>)</li>
<li>Documentation query (<a href="https://github.com/ocaml/ocaml-lsp/pull/1336">ocaml/ocaml-lsp#1336</a>)</li>
</ul></li>
<li>Created a custom construct query (<a href="https://github.com/ocaml/ocaml-lsp/pull/1348">ocaml/ocaml-lsp#1348</a>)</li>
<li>Implemented semantic and syntactic movement shortcuts (<a href="https://github.com/ocaml/ocaml-lsp/pull/1364">ocaml/ocaml-lsp#1364</a>)</li>
<li>Backported and released Merlin 4.16 with necessary commands (<a href="https://github.com/ocaml/opam-repository/pull/26052">opam-repository PR</a>)</li>
<li>Refactored usage of <code>Typedtree</code> from <code>ocaml-lsp</code> to <code>merlin-lib</code> (<a href="https://github.com/ocaml/merlin/pull/1811">ocaml/merlin#1811</a>, <a href="https://github.com/ocaml/merlin/pull/1812">ocaml/merlin#1812</a>)</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">First alpha release of OCaml 5.3.0</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/first-alpha-release-of-ocaml-5-3-0/15315/1">https://discuss.ocaml.org/t/first-alpha-release-of-ocaml-5-3-0/15315/1</a>
</p>
</div>

<div id="outline-container-org02ea6bd" class="outline-3">
<h3 id="org02ea6bd">octachron announced</h3>
<div class="outline-text-3" id="text-org02ea6bd">
<p>
Four months after the release of OCaml 5.2.0, the set of new features for the future version 5.3.0 of OCaml has been frozen. We are thus happy to announce the first alpha release for OCaml 5.3.0.
</p>

<p>
This alpha version is here to help fellow hackers join us early in our bug hunting and opam ecosystem fixing fun (see below for the installation instructions). More information about the whole release process is now available in the <a href="https://github.com/ocaml/ocaml/blob/trunk/release-info/introduction.md">compiler repository</a>.
</p>

<p>
The progresses on stabilizing the ecosystem are tracked on the <a href="https://github.com/ocaml/opam-repository/issues/26596">opam readiness for 5.3.0 meta-issue</a>.
</p>

<p>
The full release is expected around November, see the <a href="https://github.com/ocaml/ocaml/blob/trunk/release-info/calendar.md">new prospective calendar</a> for more information.
</p>

<p>
If you find any bugs, please report them on <a href="https://github.com/ocaml/ocaml/issues">OCaml's issue tracker</a>.
</p>

<p>
If you are interested in the ongoing list of new features and bug fixes, the updated change log for OCaml 5.3.0 is available <a href="https://github.com/ocaml/ocaml/blob/5.3/Changes">on GitHub</a>.
</p>
</div>


<div id="outline-container-org0cab05e" class="outline-4">
<h4 id="org0cab05e">Installation Instructions</h4>
<div class="outline-text-4" id="text-org0cab05e">
<p>
The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:
</p>

<pre class="example" id="orgc9e98b7">
opam update
opam switch create 5.3.0~alpha1
</pre>

<p>
The source code for the alpha is also available at these addresses:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/5.3.0-alpha1.tar.gz">GitHub</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-5.3/ocaml-5.3.0~alpha1.tar.gz">OCaml archives at Inria</a></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org9344766"></a>Fine-Tuned Compiler Configuration<br />
<div class="outline-text-5" id="text-org9344766">
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>

<pre class="example" id="orgae25f8d">
opam update
opam switch create &lt;switch_name&gt; ocaml-variants.5.3.0~alpha1+options &lt;option_list&gt;
</pre>

<p>
where <code>option_list</code> is a space separated list of <code>ocaml-option-*</code> packages. For instance, for a flambda and no-flat-float-array switch:
</p>

<pre class="example" id="orgf522689">
opam switch create 5.3.0~alpha1+flambda+nffa ocaml-variants.5.3.0~alpha1+options ocaml-option-flambda ocaml-option-no-flat-float-array
</pre>

<p>
All available options can be listed with <code>opam search ocaml-option</code>.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">Ascend - Dungeon RPG for your terminal</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ascend-dungeon-rpg-for-your-terminal/15319/1">https://discuss.ocaml.org/t/ann-ascend-dungeon-rpg-for-your-terminal/15319/1</a>
</p>
</div>

<div id="outline-container-org4fca81a" class="outline-3">
<h3 id="org4fca81a">eir announced</h3>
<div class="outline-text-3" id="text-org4fca81a">
<p>
Announcing the first release of <b><a href="https://github.com/m-laniakea/ascend">ascend</a></b>!
</p>

<p>
Venture into the depths to retrieve the stolen artifact, and hopefully escape with your life&#x2026;
NetHack lite.
</p>

<p>
<b>Get it via:</b>
</p>
<pre class="example" id="orgdf2d21f">
opam install ascend
ascend
</pre>

<p>
Rievax the Revelator is recruiting you for some "manual testing".
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">first release of ppx_deriving_jsonschema</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-ppx-deriving-jsonschema/15320/1">https://discuss.ocaml.org/t/ann-first-release-of-ppx-deriving-jsonschema/15320/1</a>
</p>
</div>
