2024.09.24.org
** Louis Roché announced


It is my pleasure to announce the first release of [[https://ocaml.org/p/ppx_deriving_jsonschema/latest][ppx_deriving_jsonschema]]. Source repo is https://github.com/ahrefs/ppx_deriving_jsonschema/

This small ppx should help you generate a (hopefully valid) json schema from an ocaml type. 

Generally the derivation tries to produce a schema which looks natural, and that would also be compatible with the existing derivers for json out there. Basically you should be able to change the annotation to ~[@@deriving jsonschema, yojson]~ (or ~json~ instead of ~yojson~) and to read/write json values that are matching the schema. There is a bit of tension on things like variants, which are represented as arrays by ppx_yojson_conv and ppx_deriving_yojson, but represented as enums by ppx_deriving_jsonschema. I plan to add a way to switch between the two behaviors soon.

#+begin_src ocaml
type address = {
  street: string;
  city: string;
  zip: string;
} [@@deriving jsonschema]

type t = {
  name: string;
  age: int;
  email: string option;
  address: address;
} [@@deriving jsonschema]

let schema = Ppx_deriving_jsonschema_runtime.json_schema t_jsonschema
#+end_src

Will be turned into this schema
#+begin_src json
{
  "$schema": "https://json-schema.org/draft/2020-12/schema",
  "type": "object",
  "properties": {
    "address": {
      "type": "object",
      "properties": {
        "zip": { "type": "string" },
        "city": { "type": "string" },
        "street": { "type": "string" }
      },
      "required": [ "zip", "city", "street" ]
    },
    "email": { "type": "string" },
    "age": { "type": "integer" },
    "name": { "type": "string" }
  },
  "required": [ "address", "age", "name" ]
}
#+end_src

Some more advanced functionalities are documented in the readme.

Please let me know if you see any important feature missing, if there are bugs, or if you have ideas of improvements.

This project was originally started during a Ahrefs dojo, in parallel to the ICFP conference in Milan, as a way to learn how to write a ppx. I can't recommend enough https://github.com/pedrobslisboa/ppx-by-example to get going.
      



* opam 2.3.0~alpha1
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/ann-opam-2-3-0-alpha1/15325/1

** Kate announced


As mentioned in [[https://icfp24.sigplan.org/details/ocaml-2024-papers/10/Opam-2-2-and-beyond][our talk at the OCaml Workshop 2024]], we decided to switch to a time-based release cycle (every 6 months), starting with opam 2.3.

As promised, we are happy to announce the first alpha release of opam 2.3.0.

*** What's new?

- When loading a repository, *opam now ignores files in packages' ~files/~ directories which aren't listed in the ~extra-files~ field* of the opam file. :warning: If you maintain an opam repository, please read our [[https://opam.ocaml.org/blog/opam-2-3-0-alpha1/][blog post]] to make sure your repository stays compatible.
- *Packages requiring an unsupported version of opam are now marked unavailable*, instead of causing a repository error. This means an opam repository can now allow smoother upgrade in the future
- *~opam list --latests-only~*: a new option to list only the latest versions of packages
- *~--verbose-on~*: a new option to enable verbose output for specified package names.
- *~opam switch import --deps-only~*: a new option to install only the dependencies of the root packages listed in the opam switch export file
- *~opam switch list-available~* will now not display compilers flagged with ~avoid-version~/~deprecated~ unless ~--all~ is given, meaning that the "trunk" build of OCaml no longer appears to be the latest version
- *The ~builtin-0install~ solver was improved* and should now be capable of being your default solver instead of ~builtin-mccs+glpk~. If you wish to give it a try, simply call ~opam option solver=builtin-0install~
- Most of the *unhelpful conflict messages were fixed* :flashlight:

Various performance and other improvements were made and bugs were fixed.
:open_book: You can read our [[https://opam.ocaml.org/blog/opam-2-3-0-alpha1/][blog post]] for more information about these changes and more, and for even more details you can take a look at the [[https://github.com/ocaml/opam/releases/tag/2.3.0-alpha1][release note]] or the [[https://github.com/ocaml/opam/blob/2.3.0-alpha1/CHANGES][changelog]].

*** Try it!

The upgrade instructions are unchanged:

For Unix systems
#+begin_example
bash -c "sh <(curl -fsSL https://raw.githubusercontent.com/ocaml/opam/master/shell/install.sh) --version 2.3.0~alpha1"
#+end_example
or from PowerShell for Windows systems
#+begin_example
Invoke-Expression "& { $(Invoke-RestMethod https://raw.githubusercontent.com/ocaml/opam/master/shell/install.ps1) } -Version 2.3.0~alpha1"
#+end_example

Please report any issues to [[https://github.com/ocaml/opam/issues][the bug-tracker]].
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 10
:END:
** From the ocaml.org blog


Here are links from many OCaml blogs aggregated at [[https://ocaml.org/blog/][the ocaml.org blog]].

- [[https://ocaml.org/events][Upcoming OCaml Events (Sep 22, 2024 and onwards)]]
- [[https://tarides.com/blog/2024-09-19-eio-from-a-user-s-perspective-an-interview-with-simon-grondin][Eio From a User's Perspective: An Interview With Simon Grondin]]
- [[https://tarides.com/blog/2024-09-17-introducing-the-odoc-cheatsheet-your-handy-guide-to-ocaml-documentation][Introducing the ~odoc~ Cheatsheet: Your Handy Guide to OCaml Documentation]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
