2024.09.24.html

<div id="outline-container-org5cbe647" class="outline-3">
<h3 id="org5cbe647">Louis Roché announced</h3>
<div class="outline-text-3" id="text-org5cbe647">
<p>
It is my pleasure to announce the first release of <a href="https://ocaml.org/p/ppx_deriving_jsonschema/latest">ppx_deriving_jsonschema</a>. Source repo is <a href="https://github.com/ahrefs/ppx_deriving_jsonschema/">https://github.com/ahrefs/ppx_deriving_jsonschema/</a>
</p>

<p>
This small ppx should help you generate a (hopefully valid) json schema from an ocaml type. 
</p>

<p>
Generally the derivation tries to produce a schema which looks natural, and that would also be compatible with the existing derivers for json out there. Basically you should be able to change the annotation to <code>[@@deriving jsonschema, yojson]</code> (or <code>json</code> instead of <code>yojson</code>) and to read/write json values that are matching the schema. There is a bit of tension on things like variants, which are represented as arrays by ppx_yojson_conv and ppx_deriving_yojson, but represented as enums by ppx_deriving_jsonschema. I plan to add a way to switch between the two behaviors soon.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">type</span> <span style="color: #444fcf;">address</span> = {
  street: string;
  city: string;
  zip: string;
} <span style="color: #9f0d0f;">[@@deriving jsonschema]</span>

<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #444fcf;">t</span> = {
  name: string;
  age: int;
  email: string option;
  address: address;
} <span style="color: #9f0d0f;">[@@deriving jsonschema]</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #007a9f;">schema</span> = <span style="color: #444fcf;">Ppx_deriving_jsonschema_runtime.</span>json_schema t_jsonschema
</pre>
</div>

<p>
Will be turned into this schema
</p>
<div class="org-src-container">
<pre class="src src-json">{
  "$schema": "https://json-schema.org/draft/2020-12/schema",
  "type": "object",
  "properties": {
    "address": {
      "type": "object",
      "properties": {
        "zip": { "type": "string" },
        "city": { "type": "string" },
        "street": { "type": "string" }
      },
      "required": [ "zip", "city", "street" ]
    },
    "email": { "type": "string" },
    "age": { "type": "integer" },
    "name": { "type": "string" }
  },
  "required": [ "address", "age", "name" ]
}
</pre>
</div>

<p>
Some more advanced functionalities are documented in the readme.
</p>

<p>
Please let me know if you see any important feature missing, if there are bugs, or if you have ideas of improvements.
</p>

<p>
This project was originally started during a Ahrefs dojo, in parallel to the ICFP conference in Milan, as a way to learn how to write a ppx. I can't recommend enough <a href="https://github.com/pedrobslisboa/ppx-by-example">https://github.com/pedrobslisboa/ppx-by-example</a> to get going.
</p>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">opam 2.3.0~alpha1</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-2-3-0-alpha1/15325/1">https://discuss.ocaml.org/t/ann-opam-2-3-0-alpha1/15325/1</a>
</p>
</div>

<div id="outline-container-org74a85c0" class="outline-3">
<h3 id="org74a85c0">Kate announced</h3>
<div class="outline-text-3" id="text-org74a85c0">
<p>
As mentioned in <a href="https://icfp24.sigplan.org/details/ocaml-2024-papers/10/Opam-2-2-and-beyond">our talk at the OCaml Workshop 2024</a>, we decided to switch to a time-based release cycle (every 6 months), starting with opam 2.3.
</p>

<p>
As promised, we are happy to announce the first alpha release of opam 2.3.0.
</p>
</div>

<div id="outline-container-orga86223d" class="outline-4">
<h4 id="orga86223d">What's new?</h4>
<div class="outline-text-4" id="text-orga86223d">
<ul class="org-ul">
<li>When loading a repository, <b>opam now ignores files in packages' <code>files/</code> directories which aren't listed in the <code>extra-files</code> field</b> of the opam file. :warning: If you maintain an opam repository, please read our <a href="https://opam.ocaml.org/blog/opam-2-3-0-alpha1/">blog post</a> to make sure your repository stays compatible.</li>
<li><b>Packages requiring an unsupported version of opam are now marked unavailable</b>, instead of causing a repository error. This means an opam repository can now allow smoother upgrade in the future</li>
<li><b><code>opam list --latests-only</code></b>: a new option to list only the latest versions of packages</li>
<li><b><code>--verbose-on</code></b>: a new option to enable verbose output for specified package names.</li>
<li><b><code>opam switch import --deps-only</code></b>: a new option to install only the dependencies of the root packages listed in the opam switch export file</li>
<li><b><code>opam switch list-available</code></b> will now not display compilers flagged with <code>avoid-version~/~deprecated</code> unless <code>--all</code> is given, meaning that the "trunk" build of OCaml no longer appears to be the latest version</li>
<li><b>The <code>builtin-0install</code> solver was improved</b> and should now be capable of being your default solver instead of <code>builtin-mccs+glpk</code>. If you wish to give it a try, simply call <code>opam option solver=builtin-0install</code></li>
<li>Most of the <b>unhelpful conflict messages were fixed</b> :flashlight:</li>
</ul>

<p>
Various performance and other improvements were made and bugs were fixed.
:open_book: You can read our <a href="https://opam.ocaml.org/blog/opam-2-3-0-alpha1/">blog post</a> for more information about these changes and more, and for even more details you can take a look at the <a href="https://github.com/ocaml/opam/releases/tag/2.3.0-alpha1">release note</a> or the <a href="https://github.com/ocaml/opam/blob/2.3.0-alpha1/CHANGES">changelog</a>.
</p>
</div>
</div>

<div id="outline-container-orgdd3d46b" class="outline-4">
<h4 id="orgdd3d46b">Try it!</h4>
<div class="outline-text-4" id="text-orgdd3d46b">
<p>
The upgrade instructions are unchanged:
</p>

<p>
For Unix systems
</p>
<pre class="example" id="orgcce0775">
bash -c "sh &lt;(curl -fsSL https://raw.githubusercontent.com/ocaml/opam/master/shell/install.sh) --version 2.3.0~alpha1"
</pre>
<p>
or from PowerShell for Windows systems
</p>
<pre class="example" id="orgd142f2d">
Invoke-Expression "&amp; { $(Invoke-RestMethod https://raw.githubusercontent.com/ocaml/opam/master/shell/install.ps1) } -Version 2.3.0~alpha1"
</pre>

<p>
Please report any issues to <a href="https://github.com/ocaml/opam/issues">the bug-tracker</a>.
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-10" class="outline-2">
<h2 id="10">Other OCaml News</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org5cffdee" class="outline-3">
<h3 id="org5cffdee">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org5cffdee">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://ocaml.org/events">Upcoming OCaml Events (Sep 22, 2024 and onwards)</a></li>
<li><a href="https://tarides.com/blog/2024-09-19-eio-from-a-user-s-perspective-an-interview-with-simon-grondin">Eio From a User's Perspective: An Interview With Simon Grondin</a></li>
<li><a href="https://tarides.com/blog/2024-09-17-introducing-the-odoc-cheatsheet-your-handy-guide-to-ocaml-documentation">Introducing the <code>odoc</code> Cheatsheet: Your Handy Guide to OCaml Documentation</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org08ec34d" class="outline-2">
<h2 id="org08ec34d">Old CWN</h2>
<div class="outline-text-2" id="text-org08ec34d">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org20f60b5">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
